app/views/books/show.html.erb

        <p class="profile">
        By <%= @book.user.first_name %> <%= @book.user.last_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]