app/controllers/books_controller.rb

  def index
    @books = []
    booksFromSearch = Book.search(params[:searchTerm])
    genres      = params[:searchTerm] ? booksFromSearch.distinct.pluck(:genre) : Book.distinct.pluck(:genre)
    page        = (params[:page] || 1).to_i
    per_page    = 4
    total_pages = (genres.count.to_f / per_page).ceil
    total_pages = 1 if total_pages.zero?
    start_genre = (page-1)*per_page
    genres[ start_genre...(start_genre+per_page)].each { |genre| @books.push({genre: genre, books: ( params[:searchTerm] ? booksFromSearch.where(genre: genre) : Book.where(genre: genre) ) }) }
---
SELECT DISTINCT "books"."genre" FROM "books" WHERE (genre iLIKE '%%' OR name iLIKE '%%')
SELECT "books".* FROM "books" WHERE (genre iLIKE '%%' OR name iLIKE '%%') AND "books"."genre" = $1  [["genre", "Biography/Autobiography"]]