app/controllers/chapters_controller.rb

  def create
    @chapter = Chapter.new(chapter_params)
    @chapter.book = @book
    respond_to do |format|
      if @chapter.save
---
INSERT INTO "chapters" ("name", "content", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["content", "<p>,blalalalalal</p>"], ["book_id", 2], ["created_at", "2018-12-31 15:25:47.947647"], ["updated_at", "2018-12-31 15:25:47.947647"]]

    def set_book
      @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_chapters
      @chapters  = @book.chapters.order(id: :asc)
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."book_id" = $1 ORDER BY "chapters"."id" ASC  [["book_id", 2]]