app/controllers/illustrations_controller.rb

SELECT "illustrations".* FROM "illustrations" WHERE "illustrations"."user_id" = $1  [["user_id", 2]]
---
    def index
        @illustration = Illustration.new
        @favorites = current_user.favorites
        @illustrations = Illustration.where(user: current_user)